raceTest/Setup/Deep/olaDyM/system/topoSetDict9
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    box;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1e6 -1e6 -70 ) (1e6 1e6 -69.85 );
        }
    }
    {
		name	isoProb;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1e6 -1e6 -1e6 ) (200 1e6 1e6);
        }
	}
	{
		name	isoProb;
		type	cellZoneSet;
		action	new;
		source	setToCellZone;
		sourceInfo
		{
			set	isoProb;
		}
	}
);

// ************************************************************************* //
